{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|pad|>": 1,
      "!": 2,
      "\"": 3,
      "#": 4,
      "$": 5,
      "%": 6,
      "&": 7,
      "'": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "<": 29,
      "=": 30,
      ">": 31,
      "?": 32,
      "@": 33,
      "A": 34,
      "B": 35,
      "C": 36,
      "D": 37,
      "E": 38,
      "F": 39,
      "G": 40,
      "H": 41,
      "I": 42,
      "J": 43,
      "K": 44,
      "L": 45,
      "M": 46,
      "N": 47,
      "O": 48,
      "P": 49,
      "Q": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "Z": 59,
      "[": 60,
      "\\": 61,
      "]": 62,
      "^": 63,
      "_": 64,
      "`": 65,
      "a": 66,
      "b": 67,
      "c": 68,
      "d": 69,
      "e": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "i": 74,
      "j": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "q": 82,
      "r": 83,
      "s": 84,
      "t": 85,
      "u": 86,
      "v": 87,
      "w": 88,
      "x": 89,
      "y": 90,
      "z": 91,
      "{": 92,
      "|": 93,
      "}": 94,
      "~": 95,
      "¡": 96,
      "¢": 97,
      "£": 98,
      "¤": 99,
      "¥": 100,
      "¦": 101,
      "§": 102,
      "¨": 103,
      "©": 104,
      "ª": 105,
      "«": 106,
      "¬": 107,
      "®": 108,
      "¯": 109,
      "°": 110,
      "±": 111,
      "²": 112,
      "³": 113,
      "´": 114,
      "µ": 115,
      "¶": 116,
      "·": 117,
      "¸": 118,
      "¹": 119,
      "º": 120,
      "»": 121,
      "¼": 122,
      "½": 123,
      "¾": 124,
      "¿": 125,
      "À": 126,
      "Á": 127,
      "Â": 128,
      "Ã": 129,
      "Ä": 130,
      "Å": 131,
      "Æ": 132,
      "Ç": 133,
      "È": 134,
      "É": 135,
      "Ê": 136,
      "Ë": 137,
      "Ì": 138,
      "Í": 139,
      "Î": 140,
      "Ï": 141,
      "Ð": 142,
      "Ñ": 143,
      "Ò": 144,
      "Ó": 145,
      "Ô": 146,
      "Õ": 147,
      "Ö": 148,
      "×": 149,
      "Ø": 150,
      "Ù": 151,
      "Ú": 152,
      "Û": 153,
      "Ü": 154,
      "Ý": 155,
      "Þ": 156,
      "ß": 157,
      "à": 158,
      "á": 159,
      "â": 160,
      "ã": 161,
      "ä": 162,
      "å": 163,
      "æ": 164,
      "ç": 165,
      "è": 166,
      "é": 167,
      "ê": 168,
      "ë": 169,
      "ì": 170,
      "í": 171,
      "î": 172,
      "ï": 173,
      "ð": 174,
      "ñ": 175,
      "ò": 176,
      "ó": 177,
      "ô": 178,
      "õ": 179,
      "ö": 180,
      "÷": 181,
      "ø": 182,
      "ù": 183,
      "ú": 184,
      "û": 185,
      "ü": 186,
      "ý": 187,
      "þ": 188,
      "ÿ": 189,
      "Ā": 190,
      "ā": 191,
      "Ă": 192,
      "ă": 193,
      "Ą": 194,
      "ą": 195,
      "Ć": 196,
      "ć": 197,
      "Ĉ": 198,
      "ĉ": 199,
      "Ċ": 200,
      "ċ": 201,
      "Č": 202,
      "č": 203,
      "Ď": 204,
      "ď": 205,
      "Đ": 206,
      "đ": 207,
      "Ē": 208,
      "ē": 209,
      "Ĕ": 210,
      "ĕ": 211,
      "Ė": 212,
      "ė": 213,
      "Ę": 214,
      "ę": 215,
      "Ě": 216,
      "ě": 217,
      "Ĝ": 218,
      "ĝ": 219,
      "Ğ": 220,
      "ğ": 221,
      "Ġ": 222,
      "ġ": 223,
      "Ģ": 224,
      "ģ": 225,
      "Ĥ": 226,
      "ĥ": 227,
      "Ħ": 228,
      "ħ": 229,
      "Ĩ": 230,
      "ĩ": 231,
      "Ī": 232,
      "ī": 233,
      "Ĭ": 234,
      "ĭ": 235,
      "Į": 236,
      "į": 237,
      "İ": 238,
      "ı": 239,
      "Ĳ": 240,
      "ĳ": 241,
      "Ĵ": 242,
      "ĵ": 243,
      "Ķ": 244,
      "ķ": 245,
      "ĸ": 246,
      "Ĺ": 247,
      "ĺ": 248,
      "Ļ": 249,
      "ļ": 250,
      "Ľ": 251,
      "ľ": 252,
      "Ŀ": 253,
      "ŀ": 254,
      "Ł": 255,
      "ł": 256,
      "Ń": 257,
      "Ġt": 258,
      "he": 259,
      "Ġa": 260,
      "in": 261,
      "Ġthe": 262,
      "er": 263,
      "on": 264,
      "Ġ,": 265,
      "re": 266,
      "Ġs": 267,
      "ed": 268,
      "Ġo": 269,
      "Ġw": 270,
      "nd": 271,
      "at": 272,
      "Ġ.": 273,
      "or": 274,
      "it": 275,
      "Ġc": 276,
      "en": 277,
      "Ġf": 278,
      "is": 279,
      "es": 280,
      "ar": 281,
      "Ġof": 282,
      "Ġb": 283,
      "an": 284,
      "Ġin": 285,
      "al": 286,
      "ing": 287,
      "Ġp": 288,
      "Ġand": 289,
      "as": 290,
      "Ġto": 291,
      "ro": 292,
      "ic": 293,
      "Ġm": 294,
      "Ġd": 295,
      "Ġh": 296,
      "ion": 297,
      "le": 298,
      "ou": 299,
      "ĠT": 300,
      "Ġre": 301,
      "Ġ=": 302,
      "Ġ\"": 303,
      "ĠA": 304,
      "ĠS": 305,
      "ent": 306,
      "il": 307,
      "Ġth": 308,
      "Ġ1": 309,
      "st": 310,
      "ĠC": 311,
      "el": 312,
      "om": 313,
      "Ġl": 314,
      "am": 315,
      "ĠĊ": 316,
      "Ġe": 317,
      "Ġn": 318,
      "Ġ@": 319,
      "ad": 320,
      "ac": 321,
      "Ġwas": 322,
      "ĠM": 323,
      "ur": 324,
      "ĠThe": 325,
      "ec": 326,
      "Ġon": 327,
      "ly": 328,
      "ĠB": 329,
      "ĠI": 330,
      "Ġg": 331,
      "Ġ'": 332,
      "et": 333,
      "ol": 334,
      "id": 335,
      "iv": 336,
      "im": 337,
      "Ġfor": 338,
      "ir": 339,
      "-@": 340,
      "Ġ@-@": 341,
      "ig": 342,
      "ot": 343,
      "ter": 344,
      "Ġas": 345,
      "ĠH": 346,
      "us": 347,
      "ow": 348,
      "Ġst": 349,
      "ut": 350,
      "ith": 351,
      "ay": 352,
      "Ġ2": 353,
      "ĠP": 354,
      "ation": 355,
      "ver": 356,
      "Ġbe": 357,
      "her": 358,
      "Ġthat": 359,
      "Ġwith": 360,
      "ĠR": 361,
      "ce": 362,
      "th": 363,
      "ĠD": 364,
      "Ġis": 365,
      "un": 366,
      "em": 367,
      "ĠF": 368,
      "Ġwh": 369,
      "ul": 370,
      "Ġby": 371,
      "Ġal": 372,
      "ch": 373,
      "Ġ)": 374,
      "Ġ(": 375,
      "ĠW": 376,
      "Ġcon": 377,
      "ra": 378,
      "ĠG": 379,
      "os": 380,
      "ĠL": 381,
      "ĠN": 382,
      "Ġat": 383,
      "ers": 384,
      "ct": 385,
      "Ġit": 386,
      "Ġ19": 387,
      "rom": 388,
      "and": 389,
      "Ġan": 390,
      "um": 391,
      "est": 392,
      "ĠJ": 393,
      "ag": 394,
      "Ġhe": 395,
      "00": 396,
      "ist": 397,
      "ain": 398,
      "od": 399,
      "av": 400,
      "ri": 401,
      "ĠE": 402,
      "ĠO": 403,
      "Ġfrom": 404,
      "Ġcom": 405,
      "Ġhis": 406,
      "op": 407,
      "Ġpro": 408,
      "res": 409,
      "ies": 410,
      "if": 411,
      "Ġv": 412,
      "ort": 413,
      "ere": 414,
      "ill": 415,
      "ld": 416,
      "Ġde": 417,
      "pp": 418,
      "Ġsu": 419,
      "ore": 420,
      "ĠIn": 421,
      "Ġr": 422,
      "Ġse": 423,
      "Ġwere": 424,
      "ew": 425,
      "ong": 426,
      "igh": 427,
      "ard": 428,
      "ate": 429,
      "all": 430,
      "art": 431,
      "ak": 432,
      "ich": 433,
      "Ġch": 434,
      "Ġor": 435,
      "ab": 436,
      "ant": 437,
      "ud": 438,
      "oc": 439,
      "ber": 440,
      "Ġex": 441,
      "gh": 442,
      "ity": 443,
      "ated": 444,
      "pt": 445,
      "ess": 446,
      "ear": 447,
      "ĠK": 448,
      "Ġpl": 449,
      "ame": 450,
      "qu": 451,
      "ive": 452,
      "rou": 453,
      "Ġare": 454,
      "Ġâ": 455,
      "Ġsh": 456,
      "Ġk": 457,
      "ack": 458,
      "ect": 459,
      "ĠâĢ": 460,
      "ĠU": 461,
      "Ġhad": 462,
      "se": 463,
      "Ġwhich": 464,
      "red": 465,
      "ov": 466,
      "ĠSt": 467,
      "ast": 468,
      "Ġsp": 469,
      "ian": 470,
      "Ġy": 471,
      "ment": 472,
      "Ġle": 473,
      "Ġnot": 474,
      "ge": 475,
      "ord": 476,
      "rit": 477,
      "ip": 478,
      "ine": 479,
      "ell": 480,
      "ally": 481,
      "our": 482,
      "ost": 483,
      "ight": 484,
      "ther": 485,
      "ap": 486,
      "Ġu": 487,
      "ish": 488,
      "ĠCh": 489,
      "oun": 490,
      "ia": 491,
      "Ġ3": 492,
      "ave": 493,
      "ary": 494,
      "ust": 495,
      "og": 496,
      "Ġ200": 497,
      "Ġun": 498,
      "ous": 499
    },
    "merges": [
      [
        "Ġ",
        "t"
      ],
      [
        "h",
        "e"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "i",
        "n"
      ],
      [
        "Ġt",
        "he"
      ],
      [
        "e",
        "r"
      ],
      [
        "o",
        "n"
      ],
      [
        "Ġ",
        ","
      ],
      [
        "r",
        "e"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "e",
        "d"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "n",
        "d"
      ],
      [
        "a",
        "t"
      ],
      [
        "Ġ",
        "."
      ],
      [
        "o",
        "r"
      ],
      [
        "i",
        "t"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "e",
        "n"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "i",
        "s"
      ],
      [
        "e",
        "s"
      ],
      [
        "a",
        "r"
      ],
      [
        "Ġo",
        "f"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "a",
        "n"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "a",
        "l"
      ],
      [
        "in",
        "g"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "Ġa",
        "nd"
      ],
      [
        "a",
        "s"
      ],
      [
        "Ġt",
        "o"
      ],
      [
        "r",
        "o"
      ],
      [
        "i",
        "c"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "Ġ",
        "h"
      ],
      [
        "i",
        "on"
      ],
      [
        "l",
        "e"
      ],
      [
        "o",
        "u"
      ],
      [
        "Ġ",
        "T"
      ],
      [
        "Ġ",
        "re"
      ],
      [
        "Ġ",
        "="
      ],
      [
        "Ġ",
        "\""
      ],
      [
        "Ġ",
        "A"
      ],
      [
        "Ġ",
        "S"
      ],
      [
        "en",
        "t"
      ],
      [
        "i",
        "l"
      ],
      [
        "Ġt",
        "h"
      ],
      [
        "Ġ",
        "1"
      ],
      [
        "s",
        "t"
      ],
      [
        "Ġ",
        "C"
      ],
      [
        "e",
        "l"
      ],
      [
        "o",
        "m"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "a",
        "m"
      ],
      [
        "Ġ",
        "Ċ"
      ],
      [
        "Ġ",
        "e"
      ],
      [
        "Ġ",
        "n"
      ],
      [
        "Ġ",
        "@"
      ],
      [
        "a",
        "d"
      ],
      [
        "a",
        "c"
      ],
      [
        "Ġw",
        "as"
      ],
      [
        "Ġ",
        "M"
      ],
      [
        "u",
        "r"
      ],
      [
        "ĠT",
        "he"
      ],
      [
        "e",
        "c"
      ],
      [
        "Ġ",
        "on"
      ],
      [
        "l",
        "y"
      ],
      [
        "Ġ",
        "B"
      ],
      [
        "Ġ",
        "I"
      ],
      [
        "Ġ",
        "g"
      ],
      [
        "Ġ",
        "'"
      ],
      [
        "e",
        "t"
      ],
      [
        "o",
        "l"
      ],
      [
        "i",
        "d"
      ],
      [
        "i",
        "v"
      ],
      [
        "i",
        "m"
      ],
      [
        "Ġf",
        "or"
      ],
      [
        "i",
        "r"
      ],
      [
        "-",
        "@"
      ],
      [
        "Ġ@",
        "-@"
      ],
      [
        "i",
        "g"
      ],
      [
        "o",
        "t"
      ],
      [
        "t",
        "er"
      ],
      [
        "Ġa",
        "s"
      ],
      [
        "Ġ",
        "H"
      ],
      [
        "u",
        "s"
      ],
      [
        "o",
        "w"
      ],
      [
        "Ġs",
        "t"
      ],
      [
        "u",
        "t"
      ],
      [
        "it",
        "h"
      ],
      [
        "a",
        "y"
      ],
      [
        "Ġ",
        "2"
      ],
      [
        "Ġ",
        "P"
      ],
      [
        "at",
        "ion"
      ],
      [
        "v",
        "er"
      ],
      [
        "Ġb",
        "e"
      ],
      [
        "he",
        "r"
      ],
      [
        "Ġth",
        "at"
      ],
      [
        "Ġw",
        "ith"
      ],
      [
        "Ġ",
        "R"
      ],
      [
        "c",
        "e"
      ],
      [
        "t",
        "h"
      ],
      [
        "Ġ",
        "D"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "u",
        "n"
      ],
      [
        "e",
        "m"
      ],
      [
        "Ġ",
        "F"
      ],
      [
        "Ġw",
        "h"
      ],
      [
        "u",
        "l"
      ],
      [
        "Ġb",
        "y"
      ],
      [
        "Ġa",
        "l"
      ],
      [
        "c",
        "h"
      ],
      [
        "Ġ",
        ")"
      ],
      [
        "Ġ",
        "("
      ],
      [
        "Ġ",
        "W"
      ],
      [
        "Ġc",
        "on"
      ],
      [
        "r",
        "a"
      ],
      [
        "Ġ",
        "G"
      ],
      [
        "o",
        "s"
      ],
      [
        "Ġ",
        "L"
      ],
      [
        "Ġ",
        "N"
      ],
      [
        "Ġa",
        "t"
      ],
      [
        "er",
        "s"
      ],
      [
        "c",
        "t"
      ],
      [
        "Ġ",
        "it"
      ],
      [
        "Ġ1",
        "9"
      ],
      [
        "ro",
        "m"
      ],
      [
        "a",
        "nd"
      ],
      [
        "Ġa",
        "n"
      ],
      [
        "u",
        "m"
      ],
      [
        "es",
        "t"
      ],
      [
        "Ġ",
        "J"
      ],
      [
        "a",
        "g"
      ],
      [
        "Ġ",
        "he"
      ],
      [
        "0",
        "0"
      ],
      [
        "is",
        "t"
      ],
      [
        "a",
        "in"
      ],
      [
        "o",
        "d"
      ],
      [
        "a",
        "v"
      ],
      [
        "r",
        "i"
      ],
      [
        "Ġ",
        "E"
      ],
      [
        "Ġ",
        "O"
      ],
      [
        "Ġf",
        "rom"
      ],
      [
        "Ġc",
        "om"
      ],
      [
        "Ġh",
        "is"
      ],
      [
        "o",
        "p"
      ],
      [
        "Ġp",
        "ro"
      ],
      [
        "re",
        "s"
      ],
      [
        "i",
        "es"
      ],
      [
        "i",
        "f"
      ],
      [
        "Ġ",
        "v"
      ],
      [
        "or",
        "t"
      ],
      [
        "er",
        "e"
      ],
      [
        "il",
        "l"
      ],
      [
        "l",
        "d"
      ],
      [
        "Ġd",
        "e"
      ],
      [
        "p",
        "p"
      ],
      [
        "Ġs",
        "u"
      ],
      [
        "o",
        "re"
      ],
      [
        "ĠI",
        "n"
      ],
      [
        "Ġ",
        "r"
      ],
      [
        "Ġs",
        "e"
      ],
      [
        "Ġw",
        "ere"
      ],
      [
        "e",
        "w"
      ],
      [
        "on",
        "g"
      ],
      [
        "ig",
        "h"
      ],
      [
        "ar",
        "d"
      ],
      [
        "at",
        "e"
      ],
      [
        "al",
        "l"
      ],
      [
        "ar",
        "t"
      ],
      [
        "a",
        "k"
      ],
      [
        "ic",
        "h"
      ],
      [
        "Ġc",
        "h"
      ],
      [
        "Ġo",
        "r"
      ],
      [
        "a",
        "b"
      ],
      [
        "an",
        "t"
      ],
      [
        "u",
        "d"
      ],
      [
        "o",
        "c"
      ],
      [
        "b",
        "er"
      ],
      [
        "Ġe",
        "x"
      ],
      [
        "g",
        "h"
      ],
      [
        "it",
        "y"
      ],
      [
        "at",
        "ed"
      ],
      [
        "p",
        "t"
      ],
      [
        "es",
        "s"
      ],
      [
        "e",
        "ar"
      ],
      [
        "Ġ",
        "K"
      ],
      [
        "Ġp",
        "l"
      ],
      [
        "am",
        "e"
      ],
      [
        "q",
        "u"
      ],
      [
        "iv",
        "e"
      ],
      [
        "ro",
        "u"
      ],
      [
        "Ġa",
        "re"
      ],
      [
        "Ġ",
        "â"
      ],
      [
        "Ġs",
        "h"
      ],
      [
        "Ġ",
        "k"
      ],
      [
        "ac",
        "k"
      ],
      [
        "ec",
        "t"
      ],
      [
        "Ġâ",
        "Ģ"
      ],
      [
        "Ġ",
        "U"
      ],
      [
        "Ġh",
        "ad"
      ],
      [
        "s",
        "e"
      ],
      [
        "Ġwh",
        "ich"
      ],
      [
        "re",
        "d"
      ],
      [
        "o",
        "v"
      ],
      [
        "ĠS",
        "t"
      ],
      [
        "as",
        "t"
      ],
      [
        "Ġs",
        "p"
      ],
      [
        "i",
        "an"
      ],
      [
        "Ġ",
        "y"
      ],
      [
        "m",
        "ent"
      ],
      [
        "Ġ",
        "le"
      ],
      [
        "Ġn",
        "ot"
      ],
      [
        "g",
        "e"
      ],
      [
        "or",
        "d"
      ],
      [
        "r",
        "it"
      ],
      [
        "i",
        "p"
      ],
      [
        "in",
        "e"
      ],
      [
        "el",
        "l"
      ],
      [
        "al",
        "ly"
      ],
      [
        "ou",
        "r"
      ],
      [
        "o",
        "st"
      ],
      [
        "igh",
        "t"
      ],
      [
        "t",
        "her"
      ],
      [
        "a",
        "p"
      ],
      [
        "Ġ",
        "u"
      ],
      [
        "is",
        "h"
      ],
      [
        "ĠC",
        "h"
      ],
      [
        "ou",
        "n"
      ],
      [
        "i",
        "a"
      ],
      [
        "Ġ",
        "3"
      ],
      [
        "av",
        "e"
      ],
      [
        "ar",
        "y"
      ],
      [
        "u",
        "st"
      ],
      [
        "o",
        "g"
      ],
      [
        "Ġ2",
        "00"
      ],
      [
        "Ġ",
        "un"
      ],
      [
        "ou",
        "s"
      ]
    ]
  }
}